In [7]:
import pandas as pd

In [8]:
Data Analysis
1. Description
2. Diagnosis
3. Prediction
4. Action/prescription

SyntaxError: invalid syntax (3453781735.py, line 1)

In [ ]:
item_cols = ['movie_id','title']+ [str(i) for i in range(22)]

In [9]:
#read the other file
df1 = pd.read_csv('u.item',sep='|', names = item_cols, encoding = "ISO-8859-1") [['movie_id','title']]

NameError: name 'item_cols' is not defined

In [10]:
#Read the files
df = pd.read_csv('u.data',sep='\t',names=cols)

NameError: name 'cols' is not defined

In [87]:
# The column names
cols = ['user_id','movie_id','rating','ts']

In [88]:
df1.shape

(1682, 2)

# Exploratory Data Analysis

In [89]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [90]:
df1.sample(3)

      movie_id                         title
1183      1184  Endless Summer 2, The (1994)
50          51    Legends of the Fall (1994)
631        632        Sophie's Choice (1982)

In [91]:
df1.sample(5)

     movie_id                                   title
524       525                   Big Sleep, The (1946)
881       882                Washington Square (1997)
547       548       NeverEnding Story III, The (1994)
435       436  American Werewolf in London, An (1981)
41         42                           Clerks (1994)

In [92]:
df.sample(5)

       user_id  movie_id  rating         ts
72173      452      1057       1  876215627
23403      303       808       2  879484480
79817      624       329       3  891961120
4364       222       501       2  881060331
33900      276       189       4  874977555

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [94]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [95]:
#string data categorical info , random stuff
#numerical data quantanized , categorical 
#random numbers or to sort of data

In [96]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [97]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [98]:
df['rating'].nunique()

5

In [99]:
df['user_id'].nunique()

944

In [100]:
df['movie_id'].nunique()

1682

In [101]:
#merging Dataframes

In [102]:
movie = pd.merge(df,df1, on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [103]:
#remove the redundant of useless columns i.e. ts
movie.drop('ts',axis=1,inplace=True)

In [104]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [106]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [109]:
#number of rating for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [5]:
#find the average rating for each movie

In [6]:
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

NameError: name 'movie' is not defined